package operator

import (
	"testing"
)

func TestOperator(t *testing.T) {
	//运算符  +  -  *  /  %  --  ++
	// 不支持前自增  ++a  这种情况

	//比较运算符 ==  !=  >  <  >=  <=  * 数组比较  切片比较 *

	//逻辑运算符  &&  ||  ！

	//位运算符 &  |  ！  <<  >>
	// 按位清零 &^
	/*
	此运算符特点：

	1、如果右侧是0，则左侧数保持不变

	2、如果右侧是1，则左侧数一定清零

	3、功能同a&(^b)相同
	4、如果左侧是变量，也等同于：
			var a int
			a &^= b
	 */

	//数组构建
	//a := [...] int{1, 2, 3, 4, 5}
	//b := [...] int{1, 2, 3, 4, 5}
	//c := [...] int{1, 2, 3, 4, 5, 6}

	//数组循环

	//for key,value := range a{
	//	fmt.Println(key," : ",value)
	//}

	//strArr := [...] string {"1","2","3","4","5","6","7","8","9","10"}
	x := 2
    y := 2
    t.Log(x &^ y)

    t.Log(^y)
    t.Log(3&2)

}
